# Data Wrangling

<a href='https://pandas.pydata.org/pandas-docs/stable/getting_started/10min.html'>10 minutes to Pandas</a>

In [3]:
import pandas as pd
import numpy as np

## Object creation

series creation

In [6]:
s = pd.Series([0, 1, 2, 3, 4])

In [35]:
s

0    0
1    1
2    2
3    3
4    4
dtype: int64

Dataframe creation employing several methods:

In [38]:
df = pd.DataFrame({
    'A': 1., # fills column A with 1.0
    'B': pd.Timestamp('20130102'), # fills column B with a date
    'C': pd.Series(1, index=list(range(4)), dtype='float32'), # creates a series to fill column C
    'D': np.array([3]*4, dtype='int32'), # creates and expand a list to fill column
    'E': pd.Categorical(['test', 'train', 'test', 'train']), # creates categorical (not string) variable
    'F': 'foo', # fills with string variable
})

In [37]:
df

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

## Data selection

In [192]:
A = pd.read_excel('A.xlsx')

In [193]:
A

  col0 col1 col2 col3 col4
0   AA   BA   CA   DA   EA
1   AB   BB   CB   DB   EB
2   AC   BC   CC   DC   EC
3   AD   BD   CD   DD   ED
4   AE   BE   CE   DE   EE

In [194]:
A

  col0 col1 col2 col3 col4
0   AA   BA   CA   DA   EA
1   AB   BB   CB   DB   EB
2   AC   BC   CC   DC   EC
3   AD   BD   CD   DD   ED
4   AE   BE   CE   DE   EE

Display the index:

In [195]:
A.index

RangeIndex(start=0, stop=5, step=1)

### Display the columns:

In [196]:
A.columns

Index(['col0', 'col1', 'col2', 'col3', 'col4'], dtype='object')

NumPy representation/equivalent of data<br>
<strong>
    NumPy arrays have one data type for the entire array<br>
    Pandas DataFrames hold one data type per column
</strong>

In [197]:
A.to_numpy()

array([['AA', 'BA', 'CA', 'DA', 'EA'],
       ['AB', 'BB', 'CB', 'DB', 'EB'],
       ['AC', 'BC', 'CC', 'DC', 'EC'],
       ['AD', 'BD', 'CD', 'DD', 'ED'],
       ['AE', 'BE', 'CE', 'DE', 'EE']], dtype=object)

In [198]:
A.describe()

       col0 col1 col2 col3 col4
count     5    5    5    5    5
unique    5    5    5    5    5
top      AA   BA   CB   DC   ED
freq      1    1    1    1    1

### Transposing data

In [199]:
A.T

       0   1   2   3   4
col0  AA  AB  AC  AD  AE
col1  BA  BB  BC  BD  BE
col2  CA  CB  CC  CD  CE
col3  DA  DB  DC  DD  DE
col4  EA  EB  EC  ED  EE

### Sorting by axis:

Descending index sorting

In [200]:
A.sort_index(ascending=False)

  col0 col1 col2 col3 col4
4   AE   BE   CE   DE   EE
3   AD   BD   CD   DD   ED
2   AC   BC   CC   DC   EC
1   AB   BB   CB   DB   EB
0   AA   BA   CA   DA   EA

Descending column sorting

In [201]:
A.sort_index(axis=1, ascending=False)

  col4 col3 col2 col1 col0
0   EA   DA   CA   BA   AA
1   EB   DB   CB   BB   AB
2   EC   DC   CC   BC   AC
3   ED   DD   CD   BD   AD
4   EE   DE   CE   BE   AE

Descending sorting by both axes<br>
(Reverse the dataframe)

In [202]:
A.sort_index(axis=1, ascending=False).sort_index(axis=0, ascending=False)

  col4 col3 col2 col1 col0
4   EE   DE   CE   BE   AE
3   ED   DD   CD   BD   AD
2   EC   DC   CC   BC   AC
1   EB   DB   CB   BB   AB
0   EA   DA   CA   BA   AA

## Data Selection
### Getting

In [203]:
A['col3']

0    DA
1    DB
2    DC
3    DD
4    DE
Name: col3, dtype: object

Selecting via []<br>
row slicing

In [224]:
A[1:3]

  col0 col1 col2 col3 col4
1   AB   BB   CB   DB   EB
2   AC   BC   CC   DC   EC

### Selection by label

<strong>Pending, see following <a href='https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#indexing-label'>link</a></strong>

In [205]:
A.loc[1[2]]

TypeError: 'int' object is not subscriptable

Selecting on a single-axis by label:

In [222]:
# df.loc[start row : end row]

In [223]:
A.loc[1:3]

  col0 col1 col2 col3 col4
1   AB   BB   CB   DB   EB
2   AC   BC   CC   DC   EC
3   AD   BD   CD   DD   ED

Selection of a row portion<br>
Data is displayed as a column<br>
Notice that the non-existent column will be displayed as a ```NaN```

In [225]:
A.loc[3, ['col3', 'col1', 'col5']]

col3     DD
col1     BD
col5    NaN
Name: 3, dtype: object

Selecting only first row<br>
(data is displayed as column)

In [209]:
A.loc[0]

col0    AA
col1    BA
col2    CA
col3    DA
col4    EA
Name: 0, dtype: object

Same result as ```A.loc[0]```<br>
but in a df presentation/type

In [210]:
A.loc[:0]

  col0 col1 col2 col3 col4
0   AA   BA   CA   DA   EA

Selecting last row

In [211]:
A.loc[len(A)-1:]

  col0 col1 col2 col3 col4
4   AE   BE   CE   DE   EE

Selecting last 3 rows:

In [212]:
A.loc[len(A)-3:]

  col0 col1 col2 col3 col4
2   AC   BC   CC   DC   EC
3   AD   BD   CD   DD   ED
4   AE   BE   CE   DE   EE

Selecting on a multi-axis by label:

In [213]:
A.loc[:, ['col3', 'col5']]

  col3  col5
0   DA   NaN
1   DB   NaN
2   DC   NaN
3   DD   NaN
4   DE   NaN

In [214]:
A.loc[1:2, ['col2', 'col4']]

  col2 col4
1   CB   EB
2   CC   EC

Selecting scalar/single value:

In [215]:
A.loc[1, 'col3']

'DB'

In [216]:
A.loc[1, ['col3']]

col3    DB
Name: 1, dtype: object

In [217]:
A.loc[1:1, ['col3']]

  col3
1   DB

### Selection by position

Selection of the last row<br>
displayed as a column

In [230]:
A.iloc[len(A)-1]

col0    AE
col1    BE
col2    CE
col3    DE
col4    EE
Name: 4, dtype: object

Selection of the last row<br>
displayed as a dataframe

In [231]:
A.iloc[len(A)-1:]

  col0 col1 col2 col3 col4
4   AE   BE   CE   DE   EE

by integers (similar to numpy)

In [236]:
# syntax
# df.iloc[start row : end row -1, start col  : end col -1]

In [235]:
A.iloc[2:4, 1:3]

  col1 col2
2   BC   CC
3   BD   CD

central data

In [221]:
A.iloc[2:3, 2:3]

  col2
2   CC

## Tips & tricks

Setting a time series as index using <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.date_range.html">date_range</a>

In [8]:
dates = pd.date_range('20130101', periods=6)

In [9]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Creates a 6 x 4 array filled with random numbers

In [14]:
array = np.random.randn(6,4)

Converts to dataframe the previously declared ```array```<br>
Notice that its values will change each time the above line is executed.

In [17]:
df = pd.DataFrame(array)

In [18]:
df

          0         1         2         3
0  0.922520 -0.965442  0.683056  0.060860
1  0.359842  0.481412 -0.772904  0.394170
2 -2.217315  0.892466 -1.340334  0.050654
3 -0.914206 -2.312079  0.012812 -0.415213
4  0.182829 -0.180652 -0.533296  1.852404
5  1.964697  1.665861  0.047142 -0.024058

Setting up the previoulsy declared dates range as index of the below df

In [21]:
df = df.set_index(dates)

In [22]:
df

                   0         1         2         3
2013-01-01  0.922520 -0.965442  0.683056  0.060860
2013-01-02  0.359842  0.481412 -0.772904  0.394170
2013-01-03 -2.217315  0.892466 -1.340334  0.050654
2013-01-04 -0.914206 -2.312079  0.012812 -0.415213
2013-01-05  0.182829 -0.180652 -0.533296  1.852404
2013-01-06  1.964697  1.665861  0.047142 -0.024058

Renaming columns via dictionary

In [31]:
df = df.rename(columns = {0:'A', 1:'B', 2:'C', 3:'D'})

In [32]:
df

                   A         B         C         D
2013-01-01  0.922520 -0.965442  0.683056  0.060860
2013-01-02  0.359842  0.481412 -0.772904  0.394170
2013-01-03 -2.217315  0.892466 -1.340334  0.050654
2013-01-04 -0.914206 -2.312079  0.012812 -0.415213
2013-01-05  0.182829 -0.180652 -0.533296  1.852404
2013-01-06  1.964697  1.665861  0.047142 -0.024058